
&НаКлиенте
Процедура КнопкаВыполнить(Команда)
	КонецПорции = 1000;
	ОчиститьДенежныеСредстваВКассахККМ(КонецПорции);
	ОчиститьДенежныеСредстваБезналичные(КонецПорции);
	ОчиститьДенежныеСредстваВПути(КонецПорции);
	ОчиститьДенежныеСредстваНаличные(КонецПорции);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДенежныеСредстваВКассахККМ(КонецПорции = 1000)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваВКассахККМОстатки.КассаККМ КАК КассаККМ,
	|	ДенежныеСредстваВКассахККМОстатки.Организация КАК Организация,
	|	ДенежныеСредстваВКассахККМОстатки.СуммаОстаток КАК Сумма,
	|	ДенежныеСредстваВКассахККМОстатки.СуммаУпрОстаток КАК СуммаУпр,
	|	ДенежныеСредстваВКассахККМОстатки.СуммаРеглОстаток КАК СуммаРегл,
	|	ДенежныеСредстваВКассахККМОстатки.УдалитьКПоступлениюВКассуККМОстаток КАК УдалитьКПоступлениюВКассуККМ,
	|	ДенежныеСредстваВКассахККМОстатки.УдалитьКПоступлениюВКассуОрганизацииОстаток КАК УдалитьКПоступлениюВКассуОрганизации
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(, ) КАК ДенежныеСредстваВКассахККМОстатки";
	
	Запрос.УстановитьПараметр("КонГраница",  
	Новый Граница(КонецДня(Объект.Регистратор.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	
	НаборЗаписей = РегистрыНакопления.ДенежныеСредстваВКассахККМ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Объект.Регистратор);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Сч = 0;
	СчетчикКоличестваСтрок = 0;
	
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = НаборЗаписей.ДобавитьРасход();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Регистратор = Объект.Регистратор;
		НоваяСтрока.Период = Объект.Регистратор.Дата;
		
		СчетчикКоличестваСтрок = СчетчикКоличестваСтрок + 1;
		Сч = Сч + 1;
		
		Если Сч >= КонецПорции Тогда 
			НаборЗаписей.Записать(Ложь);
			НаборЗаписей.Очистить();
			
			Сч = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Ложь);
	Сообщить("Регистр ЗапасыНаСкладах очищен! Количество записей = " + СчетчикКоличестваСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДенежныеСредстваБезналичные(КонецПорции = 1000)		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваБезналичныеОстатки.БанковскийСчет КАК БанковскийСчет,
	|	ДенежныеСредстваБезналичныеОстатки.Организация КАК Организация,
	|	ДенежныеСредстваБезналичныеОстатки.СуммаОстаток КАК Сумма,
	|	ДенежныеСредстваБезналичныеОстатки.СуммаУпрОстаток КАК СуммаУпр,
	|	ДенежныеСредстваБезналичныеОстатки.СуммаРеглОстаток КАК СуммаРегл,
	|	ДенежныеСредстваБезналичныеОстатки.КЗачислениюОстаток КАК КЗачислению,
	|	ДенежныеСредстваБезналичныеОстатки.КСписаниюОстаток КАК КСписанию
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(, ) КАК ДенежныеСредстваБезналичныеОстатки";
	
	Запрос.УстановитьПараметр("КонГраница",  
	Новый Граница(КонецДня(Объект.Регистратор.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	
	НаборЗаписей = РегистрыНакопления.ДенежныеСредстваБезналичные.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Объект.Регистратор);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Сч = 0;
	СчетчикКоличестваСтрок = 0;
	
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = НаборЗаписей.ДобавитьРасход();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Регистратор = Объект.Регистратор;
		НоваяСтрока.Период = Объект.Регистратор.Дата;
		
		
		СчетчикКоличестваСтрок = СчетчикКоличестваСтрок + 1;
		Сч = Сч + 1;
		
		Если Сч >= КонецПорции Тогда 
			НаборЗаписей.Записать(Ложь);
			НаборЗаписей.Очистить();
			
			Сч = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Ложь);
	Сообщить("Регистр ЗапасыНаСкладах очищен! Количество записей = " + СчетчикКоличестваСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДенежныеСредстваВПути(КонецПорции = 1000)	 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваВПутиОстатки.Организация КАК Организация,
	|	ДенежныеСредстваВПутиОстатки.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ДенежныеСредстваВПутиОстатки.Получатель КАК Получатель,
	|	ДенежныеСредстваВПутиОстатки.Отправитель КАК Отправитель,
	|	ДенежныеСредстваВПутиОстатки.Контрагент КАК Контрагент,
	|	ДенежныеСредстваВПутиОстатки.Валюта КАК Валюта,
	|	ДенежныеСредстваВПутиОстатки.СуммаОстаток КАК Сумма,
	|	ДенежныеСредстваВПутиОстатки.СуммаУпрОстаток КАК СуммаУпр,
	|	ДенежныеСредстваВПутиОстатки.СуммаРеглОстаток КАК СуммаРегл
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(, ) КАК ДенежныеСредстваВПутиОстатки";
	
	Запрос.УстановитьПараметр("КонГраница",  
	Новый Граница(КонецДня(Объект.Регистратор.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	
	НаборЗаписей = РегистрыНакопления.ДенежныеСредстваВПути.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Объект.Регистратор);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Сч = 0;
	СчетчикКоличестваСтрок = 0;
	
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = НаборЗаписей.ДобавитьРасход();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Регистратор = Объект.Регистратор;
		НоваяСтрока.Период = Объект.Регистратор.Дата; 
		
		СчетчикКоличестваСтрок = СчетчикКоличестваСтрок + 1;
		Сч = Сч + 1;
		
		Если Сч >= КонецПорции Тогда 
			НаборЗаписей.Записать(Ложь);
			НаборЗаписей.Очистить();
			
			Сч = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Ложь);
	Сообщить("Регистр ЗапасыНаСкладах очищен! Количество записей = " + СчетчикКоличестваСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДенежныеСредстваНаличные(КонецПорции = 1000)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваНаличныеОстатки.Касса КАК Касса,
	|	ДенежныеСредстваНаличныеОстатки.Организация КАК Организация,
	|	ДенежныеСредстваНаличныеОстатки.СуммаОстаток КАК Сумма,
	|	ДенежныеСредстваНаличныеОстатки.СуммаУпрОстаток КАК СуммаУпр,
	|	ДенежныеСредстваНаличныеОстатки.СуммаРеглОстаток КАК СуммаРегл
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(, ) КАК ДенежныеСредстваНаличныеОстатки";
	
	Запрос.УстановитьПараметр("КонГраница",  
		Новый Граница(КонецДня(Объект.Регистратор.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	
	НаборЗаписей = РегистрыНакопления.ДенежныеСредстваНаличные.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Объект.Регистратор);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Сч = 0;
	СчетчикКоличестваСтрок = 0;
	
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = НаборЗаписей.ДобавитьРасход();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Регистратор = Объект.Регистратор;
		НоваяСтрока.Период = Объект.Регистратор.Дата;
				
		
		
		СчетчикКоличестваСтрок = СчетчикКоличестваСтрок + 1;
		Сч = Сч + 1;
		
		Если Сч >= КонецПорции Тогда 
			НаборЗаписей.Записать(Ложь);
			НаборЗаписей.Очистить();
			
			Сч = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Ложь);
	Сообщить("Регистр ЗапасыНаСкладах очищен! Количество записей = " + СчетчикКоличестваСтрок);
	
КонецПроцедуры

